src/DataProcessors/ГлавнаяФорма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ГлавнаяФорма</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>докВозврат</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.Возврат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentObject.Заказ</v8:Type>
						<v8:Type>cfg:DocumentObject.Возврат</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КаталогиТоваров</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСУП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьКоличества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросКоличества</Name>
					<Comment>при подборе в заказ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельнойСтрокой</Name>
					<Comment>при упаковке заказа не сворачивать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаличияВПродаже</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНаличияВПродаже</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВПродаже</Name>
					<Comment>по дням недели</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВПродажеВремя1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВПродажеВремя2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПечати</Name>
					<Comment>что печатать на чеке и счете</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выход</Name>
					<Comment>только для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэфПересчета</Name>
					<Comment>в номенклатуру</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСпецифик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специфики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинУдельныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксУдельныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Comment>для установки произвольного порядка элементов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бонусы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммутироемоеУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоммутируемыеУстройства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Comment>разделитель в заказе (тарелка, упаковка)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПриготовления</Name>
					<Comment>в минутах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппаЕдиниц</Name>
					<Comment>Внутри группы располагаются разные единицы одного и того же наименования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКонтроляПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтроляПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>фАлкоголь</Name>
					<Comment>1-алкоголь, 2- алкогольное пиво</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемБутылки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляМарки</Name>
					<Comment>короткое наименования для отображения в марке повара</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PLU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КогдаВПродажеПоНеделям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПонедельника</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КогдаВПродажеПоИБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьВПродаже</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродаже</Name>
							<Comment>по дням недели</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ГлавнаяФорма/Forms/Форма8/module.bsl
Перем AutohotkeyDLL;
Перем ФормаСкрытияМеню;
Перем фСменаСтраницы;

Процедура ОбновитьНадписьИтого() Экспорт
	Если Не ЭтаФорма.Открыта() Тогда
		Возврат;
	КонецЕсли;
	
	Если глСтекОкон.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;  
	
	Если ФормаСкрытияМеню <> Неопределено Тогда
		Если ФормаСкрытияМеню.Открыта() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		ДатаРождения = Заказ.ДатаРождения;
	Исключение
		ДатаРождения = Дата(1,1,1);
	КонецПопытки;
	
	Если ТекущийРежим = "ВОЗВРАТ" Тогда
		ЭлементыФормы.тпТовары.Видимость = 0;
		ЭлементыФормы.тпТоварыВозврат.Видимость = 1;
	Иначе
		ЭлементыФормы.тпТовары.Видимость = 1;
		ЭлементыФормы.тпТоварыВозврат.Видимость = 0;
	КонецЕсли;
	
	ЕстьТовары = ТекущийДокумент.Товары.Итог("Количество");
	Если ЕстьТовары Тогда 
		ЭлементыФормы.НадписьИтого.Заголовок = "СУММА: " + Формат(ТекущийДокумент.Товары.Итог("Сумма"), "ЧДЦ=2; ЧРД=.; ЧН=-") + " " + глСимволРубля;
		УстановитьДоступностьКнопки("Оплата",1,1);
		УстановитьДоступностьКнопки("Сторно",	1);
		УстановитьДоступностьКнопки("СторноВсе",1);
	Иначе
		ЭлементыФормы.НадписьИтого.Заголовок = "";
		УстановитьДоступностьКнопки("Оплата",0);
		УстановитьДоступностьКнопки("Сторно",0);
		Если ТекущийРежим = "ВОЗВРАТ" Тогда
			УстановитьДоступностьКнопки("СторноВсе", Истина);
		Иначе
			УстановитьДоступностьКнопки("СторноВсе", ?(ЗначениеЗаполнено(ДатаРождения),1,0));
		КонецЕсли;
	КонецЕсли;
	
	Если НадписьСдача <> Неопределено Тогда
		ЭлементыФормы.НадписьСумма.Заголовок = "";
		НадписьСдача = СтрЗаменить(НадписьСдача, ",", ".");
		ЭлементыФормы.НадписьИтого.Заголовок = "СДАЧА: " + НадписьСдача;
	Иначе
		ЭлементыФормы.НадписьСумма.Заголовок = "";
	КонецЕсли;
	Если Заказ.Товары.Количество() > 1 Тогда
		Попытка
			ЭлементыФормы.тпТовары.ТекущаяСтрока = Заказ.Товары[Заказ.Товары.Количество()-1];
		Исключение
		КонецПопытки;
		Попытка
			Если ЭлементыФормы.ОПЛАТА.Доступность Тогда
				ТекущийЭлемент = ЭлементыФормы.ОПЛАТА;
			Иначе
				ТекущийЭлемент = ЭлементыФормы.Кнопка1;
			КонецЕсли;
			
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	НадписьЛояльность = "";
	Если ЗначениеЗаполнено(ТекущийДокумент.НомерКартыЛояльности) Тогда
		Если СтрДлина(СокрП(ТекущийДокумент.НомерКартыЛояльности)) <= 10 Тогда
			НадписьЛояльность = "Карта: ******"+Прав(ТекущийДокумент.НомерКартыЛояльности,4);
		Иначе
			НадписьЛояльность = "Карта применена";
		КонецЕсли;
	КонецЕсли;
	
	Если Не ТекущийДокумент.КартаДоступа.Пустая() Тогда
		НадписьЛояльность = НадписьЛояльность + ?(НадписьЛояльность = "", "", Символы.ПС) +	"Карта доступа " + ТекущийДокумент.КартаДоступа;
	КонецЕсли;
	
	Если ТипЗнч(ТекущийДокумент) = Тип("ДокументОбъект.Заказ") Тогда
		Если ТекущийДокумент.Купоны.Количество() Тогда
			НадписьЛояльность = НадписьЛояльность + Символы.ПС + "Сертификат" + ?(ТекущийДокумент.Купоны.Количество() = 1, " ", "ы ") + "применен" + ?(ТекущийДокумент.Купоны.Количество() = 1, " ", "ы ");
		КонецЕсли;
	КонецЕсли;

	Если ТекКоличество <> 1 И ТекКоличество <> 0 и ТекКоличество <> Неопределено Тогда
		ЭлементыФормы.НадписьКоличество.Заголовок = "КОЛ-ВО: " + ТекКоличество;
	Иначе
		ЭлементыФормы.НадписьКоличество.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДоступностьКнопки(ИмяКнопки, Доступность, Акцент = 0, Свойство = "Доступность") Экспорт
	Кнопка = ЭлементыФормы[ИмяКнопки];
	Кнопка[Свойство] = Доступность;	
КонецПроцедуры

Процедура ОбновитьВремя() Экспорт
	ЭлементыФормы.тВремя.Заголовок = Формат(ТекущаяДатаНаСервере(),"ДФ=HH:mm");
	ЭлементыФормы.тДата.Заголовок = Формат(ТекущаяДатаНаСервере(),"ДФ='dddd, d MMMM'");
	ЭлементыФормы.тПользователь.Заголовок = ?(ТекущийРежим = "ВОЗВРАТ", "ВОЗВРАТ " + Символы.ПС, "ПРОДАЖА "+ Символы.ПС) +
											?(ЗначениеЗаполнено(глПользователь), Строка(глПользователь), "Система заблокирована");
КонецПроцедуры

Процедура ОбновитьОстальное() Экспорт
	
	ЭлементыФормы.тКасса.Заголовок = "Касса № " + глПараметрыРМ.НомерКассы;
	ЭлементыФормы.тСмена.Заголовок = "Смена № " + глПараметрыРМ.НомерСмены;
	ЭлементыФормы.тЗаказ.Заголовок = "Заказ № " + НомерТекущегоЗаказа();
	НомерТекущегоЧека = "";
	Если глСтекОкон.Количество()=1 Тогда
		ЭлементыФормы.тЧек.Заголовок   = "Чек   № " + НомерТекущегоЧека();
	ИначеЕсли глПараметрыРМ.Свойство("НомерТекущегоЧека", НомерТекущегоЧека) Тогда
		ЭлементыФормы.тЧек.Заголовок   = "Чек   № " + НомерТекущегоЧека
	КонецЕсли;
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
КонецПроцедуры

Процедура ПриОткрытии()
	ПодключитьОбработчикОжидания("ОбновитьВремя",10);
	ПодключитьОбработчикОжидания("ОбновитьОстальное",10);
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	Если ирКэш.ЭтоФайловаяБазаЛкс() Тогда
		Стиль = БиблиотекаСтилей.СтанцияОплатыОфлайн;
	Иначе
		Стиль = БиблиотекаСтилей.СтанцияОплаты;
	КонецЕсли;
	
	//ОбновитьНадписьИтого();
	//РаботаСокнами.Затемнить();
	СкрытьМенюИПанели();
	
КонецПроцедуры

Процедура СкрытьМенюИПанели() Экспорт
	ОбработкаСкрытия = ИнтерфейсРМ.ПолучитьОбъектОбработки("СкрытьМенюИПанели");
	ФормаСкрытияМеню = ОбработкаСкрытия.ПолучитьФорму();
	ФормаСкрытияМеню.Открыть();	
	
	ПодключитьОбработчикОжидания("Через2СекундыПослеОткрытия",5,1);
	
КонецПроцедуры

Процедура ВосстановитьФорму() Экспорт
	Если ФормаСкрытияМеню.Открыта() Тогда
		ПодключитьОбработчикОжидания("ВосстановитьФорму",0.5,1);	
	Иначе
		AutohotkeyDLL.ahkTextDll("
		|#NoTrayIcon
		|
		|	Send {alt down}{shift down}{VK52}{alt up}{shift up}
		|");	
		РаботаСокнами.ПереназначитьКнопки();
		РаботаСокнами.РазблокироватьВвод();
		ЭтаФорма.ТолькоПросмотр = 0;
		Заблокировать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЧерезСекундуПослеАвторизации() Экспорт
	
КонецПроцедуры

Процедура Через2СекундыПослеОткрытия() Экспорт
	ИнициализацияЗаказа(Истина);
	ОбновитьНадписьИтого();
	ЭтаФорма.ТолькоПросмотр = 1;
	
	ПодключитьОбработчикОжидания("ВосстановитьФорму",2,1);
	ПодключитьОбработчикОжидания("ЧерезСекундуПослеАвторизации",1,1);
		
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СохранитьНастройкиПользователя();
	ДействияПередЗакрытиемФормы(ЭтаФорма, Отказ);
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	
	ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура ИнициализацияТаблицыТоваров()
	
КонецПроцедуры

Процедура тпТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура тпТоварыПослеУдаления(Элемент)
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура тпТоварыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ДанныеСтроки = Неопределено Тогда
		ОформлениеСтроки.ЦветТекста = ОформлениеСтроки.ЦветФона;
		Возврат;
	КонецЕсли;
	
	Если ДанныеСтроки.фАлкоголь = 1 Тогда
		ОформлениеСтроки.Ячейки.Количество.Шрифт = Новый Шрифт("FontAwesome",24);
		ОформлениеСтроки.Ячейки.Количество.УстановитьТекст(Шрифты.ПолучитьСимвол("glass"));
		ОформлениеСтроки.Ячейки.Цена.ОтображатьТекст = 0;
	Иначе
		ОформлениеСтроки.Ячейки.х.УстановитьТекст("х");	
		Если ДанныеСтроки.Количество = 0 Тогда
			ОформлениеСтроки.Ячейки.Количество.УстановитьТекст(ДанныеСтроки.КоличествоНачальное);
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеСтроки.Количество Тогда
		ОформлениеСтроки.Ячейки.Равно.УстановитьТекст("=");	
	Иначе 
		ОформлениеСтроки.Шрифт = Новый Шрифт(ОформлениеСтроки.Шрифт,,,,,,Истина); // зачеркнутый
		ОформлениеСтроки.Ячейки.Товар.Шрифт = Новый Шрифт(ОформлениеСтроки.Ячейки.Товар.Шрифт,,,,,,Истина); // зачеркнутый
	КонецЕсли;                                                                                   
	
	
КонецПроцедуры

Процедура ПриЗакрытии()
	ИнтерфейсРМ.ПриЗакрытииОкна();	
	AutohotkeyDLL = Неопределено;
	ФормаСкрытияМеню = Неопределено;
КонецПроцедуры

Процедура СторноВсеНажатие(Элемент)
	глОтсечкаПростоя();
	СторноВсе();
	ОбновитьНадписьИтого();
КонецПроцедуры                 

Процедура тпТоварыТоварПриИзменении(Элемент)
	ЗаполнитьЗначенияСвойств(ЭлементыФормы.тпТовары.ТекущиеДанные, ЭлементыФормы.тпТовары.ТекущиеДанные.Товар);
	Если ЭлементыФормы.тпТовары.ТекущиеДанные.фАлкоголь Тогда
		ЭлементыФормы.тпТовары.ТекущиеДанные.ПДФ = ВводПДФ(ЭлементыФормы.тпТовары.ТекущиеДанные.Товар);
	КонецЕсли;
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура ПриЗакрытииМеню() Экспорт
КонецПроцедуры

Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	Если  Ложь Тогда ЗначениеВыбора = Справочники.Товары.ПустаяСсылка() КонецЕсли;
	Если ТипЗнч(ЗначениеВыбора) = Тип("СправочникСсылка.Товары") Тогда 
		Если Не ЗначениеЗаполнено(ТекКоличество) Или ТекКоличество = 1 Тогда
			
			Если ЗначениеВыбора.ЗапросКоличества Тогда
				ИзменитьКоличество();
			КонецЕсли;
	
		КонецЕсли;
		ВводНовойСтроки(ЗначениеВыбора);
	КонецЕсли;
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура ВыборТовараНажатие(Элемент)
	ВыборТовараИзМеню();
КонецПроцедуры

Процедура ПоискТовараНажатие(Элемент)
	ОткрытьФормуПоиска();
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура ЗаблокироватьНажатие(Элемент)
	ТекущийЭлемент = ЭлементыФормы.Кнопка1;
	Заблокировать();
КонецПроцедуры

Процедура ОплатаНажатие(Элемент)
	ЗарегистрироватьСобытие("Интерактивное действие.ГлавнаяФорма.Итог",,,ТекущийДокумент.Ссылка);
	Если ЭтаФорма.ТолькоПросмотр = Ложь Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		ПодключитьОбработчикОжидания("ИнтерактивнаяОплата",0.1,1);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнтерактивнаяОплата() Экспорт
	Попытка
		Если ТекущийРежим = "ВОЗВРАТ" Тогда
			ВозвратОплаты();
		Иначе
			Оплата();
		КонецЕсли;	
		ОбновитьНадписьИтого();
	Исключение
		ЗарегистрироватьСобытие("Ошибка выполенния в форме оплаты", УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЭтаФорма.ТолькоПросмотр = Ложь;
КонецПроцедуры                     

Процедура РежимАдминистратораНажатие(Элемент)
	ОткрытьМенюОпераций();
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура КоличествоНажатие(Элемент)
	ИзменитьКоличество();
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура СторноНажатие(Элемент)
	Если глСтекОкон.Количество() = 1 Тогда
		Сторно();
		ОбновитьНадписьИтого();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ИзменениеСмены" Тогда
		
		//глПараметрыРМ.Вставить("НомерСмены", ИнтерфейсРМ.ТекущаяСмена().Номер);
		фВводТоваровДоступен = ЗначениеЗаполнено(ИнтерфейсРМ.ТекущаяСмена().Номер);
	КонецЕсли; 
КонецПроцедуры

Процедура Страница2Нажатие(Элемент)
	Если Панель.ТекущаяСтраница = Панель.Страницы.Страница1 Тогда
		фСменаСтраницы = 1;
		Панель.ТекущаяСтраница = Панель.Страницы.Страница2;
		
	Иначе
		 Панель.ТекущаяСтраница = Панель.Страницы.Страница1;
	КонецЕсли;
КонецПроцедуры
 
Процедура ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если фСменаСтраницы Тогда
		фСменаСтраницы = 0;
	Иначе
		Если Панель.ТекущаяСтраница = Панель.Страницы.Страница2 Тогда
			Панель.ТекущаяСтраница = Панель.Страницы.Страница1;
		КонецЕсли;  
	КонецЕсли;  
	
КонецПроцедуры

Процедура КалькуляторНажатие(Элемент)
	//ЗапуститьПриложение("Calc");
КонецПроцедуры

Функция ПанелиСкрыты() Экспорт
	Если ФормаСкрытияМеню = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ФормаСкрытияМеню.Открыта() Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Процедура тпТоварыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если ЭлементыФормы.ОПЛАТА.Видимость И ЭлементыФормы.ОПЛАТА.Доступность Тогда
		ОплатаНажатие(Элемент);
	КонецЕсли;                 	
КонецПроцедуры

ОтборКоличество = ЭлементыФормы.тпТовары.ОтборСтрок.Количество;

ОтборКоличество.ВидСравнения = ВидСравнения.НеРавно;
//ОтборКоличество.Использование = 1;
Попытка
	AutohotkeyDLL = РаботаСокнами.AHK(,"ГлавнаяФорма");
Исключение
КонецПопытки;
фСменаСтраницы = 0;



//РаботаСокнами.ПереназначитьКнопки("ГлавнаяФорма", "HOME", "{LShift Down}1{LShift Up}"); // Количество
//РаботаСокнами.ПереназначитьКнопки("ГлавнаяФорма", "END", "{F5}"); // ИТОГ
//РаботаСокнами.ПереназначитьКнопки("ГлавнаяФорма", "F1", "^{F3}");
//РаботаСокнами.ПереназначитьКнопки("ГлавнаяФорма", "Tab", "{F6}");
//РаботаСокнами.ПереназначитьКнопки("ГлавнаяФорма", "+VKBB", "{NumpadAdd}");
//РаботаСокнами.ПереназначитьКнопки("ГлавнаяФорма", "+VKBD", "{NumpadSub}");
//РаботаСокнами.ПереназначитьКнопки("Оплата", "VKBC", "+1");
//РаботаСокнами.ПереназначитьКнопки("ГлавнаяФорма", "+8", "{NumpadMult}");
//РаботаСокнами.ПереназначитьКнопки("ГлавнаяФорма", "VKBE", "{NumpadDot}");
//РаботаСокнами.ПереназначитьКнопки("ГлавнаяФорма", "Enter", "{LCtrl Down}{Enter}{LCtrl Up}");
//РаботаСокнами.ПереназначитьКнопки("Авторизация", "~Left", "+{F2}");
//РаботаСокнами.ПереназначитьКнопки("Авторизация", "~Tab", "+{F2}");
//РаботаСокнами.ПереназначитьКнопки("Авторизация", "~Down", "+{F2}");
//РаботаСокнами.ПереназначитьКнопки("Авторизация", "~Right", "+{F2}");
